taurus/soak-test.yml
---
# Taurus Soak Test Configuration
# Extended duration test for memory leaks and degradation (20 users, 30min)

execution:
  - concurrency: 20
    ramp-up: 30s
    hold-for: 30m
    scenario: soak-test

scenarios:
  soak-test:
    default-address: https://jsonplaceholder.typicode.com
    requests:
      - url: /posts
        method: GET
        label: GET /posts
        think-time: 0.3s

      - url: /posts/${__Random(1,100)}
        method: GET
        label: GET /posts/:id
        think-time: 0.3s

      - url: /posts/${__Random(1,100)}/comments
        method: GET
        label: GET /posts/:id/comments
        think-time: 0.3s

      - url: /posts
        method: POST
        label: POST /posts
        headers:
          Content-Type: application/json
        body:
          title: "Soak test post ${__Random(1,1000)}"
          body: "Testing for extended duration"
          userId: ${__Random(1,10)}
        think-time: 0.3s

reporting:
  - module: console
  - module: final-stats
  - module: blazemeter
    test: JSONPlaceholder Soak Test
    project: JSONPlaceholder Performance

modules:
  jmeter:
    version: 5.6.3
    properties:
      jmeter.save.saveservice.response_data: false